RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/inc/bl808_sec_eng.h
/*@} end of group SEC_ENG_Public_Types */

/** @defgroup  SEC_ENG_Public_Constants
 *  @{
 */

/** @defgroup  SEC_ENG_AES_ID_TYPE
 *  @{
 */
#define IS_SEC_ENG_AES_ID_TYPE(type) (((type) == SEC_ENG_AES_ID0))

/** @defgroup  SEC_ENG_SHA_ID_TYPE
 *  @{
 */
#define IS_SEC_ENG_SHA_ID_TYPE(type) (((type) == SEC_ENG_SHA_ID0))

/** @defgroup  SEC_ENG_SHA_TYPE
 *  @{
 */
#define IS_SEC_ENG_SHA_TYPE(type) (((type) == SEC_ENG_SHA256) ||     \
                                   ((type) == SEC_ENG_SHA224) ||     \
                                   ((type) == SEC_ENG_SHA1) ||       \
                                   ((type) == SEC_ENG_SHA1_RSVD) ||  \
                                   ((type) == SEC_ENG_SHA512) ||     \
                                   ((type) == SEC_ENG_SHA384) ||     \
                                   ((type) == SEC_ENG_SHA512T224) || \
                                   ((type) == SEC_ENG_SHA512T256) || \
                                   ((type) == SEC_ENG_MD5) ||        \
                                   ((type) == SEC_ENG_CRC16) ||      \
                                   ((type) == SEC_ENG_CRC32))

/** @defgroup  SEC_ENG_AES_TYPE
 *  @{
 */
#define IS_SEC_ENG_AES_TYPE(type) (((type) == SEC_ENG_AES_ECB) || \
                                   ((type) == SEC_ENG_AES_CTR) || \
                                   ((type) == SEC_ENG_AES_CBC) || \
                                   ((type) == SEC_ENG_AES_XTS))

/** @defgroup  SEC_ENG_AES_XTS_MODE_TYPE
 *  @{
 */
#define IS_SEC_ENG_AES_XTS_MODE_TYPE(type) (((type) == SEC_ENG_AES_XTS_MODE1) || \
                                            ((type) == SEC_ENG_AES_XTS_MODE2))

/** @defgroup  SEC_ENG_AES_KEY_TYPE
 *  @{
 */
#define IS_SEC_ENG_AES_KEY_TYPE(type) (((type) == SEC_ENG_AES_KEY_128BITS) || \
                                       ((type) == SEC_ENG_AES_KEY_256BITS) || \
                                       ((type) == SEC_ENG_AES_KEY_192BITS) || \
                                       ((type) == SEC_ENG_AES_DOUBLE_KEY_128BITS))

/** @defgroup  SEC_ENG_AES_COUNTER_TYPE
 *  @{
 */
#define IS_SEC_ENG_AES_COUNTER_TYPE(type) (((type) == SEC_ENG_AES_COUNTER_BYTE_4) || \
                                           ((type) == SEC_ENG_AES_COUNTER_BYTE_1) || \
                                           ((type) == SEC_ENG_AES_COUNTER_BYTE_2) || \
                                           ((type) == SEC_ENG_AES_COUNTER_BYTE_3))

/** @defgroup  SEC_ENG_AES_VALUEUSED_TYPE
 *  @{
 */
#define IS_SEC_ENG_AES_VALUEUSED_TYPE(type) (((type) == SEC_ENG_AES_USE_NEW) || \
                                             ((type) == SEC_ENG_AES_USE_OLD))

/** @defgroup  SEC_ENG_AES_KEY_SRC_TYPE
 *  @{
 */
#define IS_SEC_ENG_AES_KEY_SRC_TYPE(type) (((type) == SEC_ENG_AES_KEY_SW) || \
                                           ((type) == SEC_ENG_AES_KEY_HW))

/** @defgroup  SEC_ENG_AES_ENDEC_TYPE
 *  @{
 */
#define IS_SEC_ENG_AES_ENDEC_TYPE(type) (((type) == SEC_ENG_AES_ENCRYPTION) || \
                                         ((type) == SEC_ENG_AES_DECRYPTION))

/** @defgroup  SEC_ENG_PKA_REG_SIZE_TYPE
 *  @{
 */
#define IS_SEC_ENG_PKA_REG_SIZE_TYPE(type) (((type) == SEC_ENG_PKA_REG_SIZE_8) ||   \
                                            ((type) == SEC_ENG_PKA_REG_SIZE_16) ||  \
                                            ((type) == SEC_ENG_PKA_REG_SIZE_32) ||  \
                                            ((type) == SEC_ENG_PKA_REG_SIZE_64) ||  \
                                            ((type) == SEC_ENG_PKA_REG_SIZE_96) ||  \
                                            ((type) == SEC_ENG_PKA_REG_SIZE_128) || \
                                            ((type) == SEC_ENG_PKA_REG_SIZE_192) || \
                                            ((type) == SEC_ENG_PKA_REG_SIZE_256) || \
                                            ((type) == SEC_ENG_PKA_REG_SIZE_384) || \
                                            ((type) == SEC_ENG_PKA_REG_SIZE_512))

/** @defgroup  SEC_ENG_PKA_OP_TYPE
 *  @{
 */
#define IS_SEC_ENG_PKA_OP_TYPE(type) (((type) == SEC_ENG_PKA_OP_PPSEL) ||         \
                                      ((type) == SEC_ENG_PKA_OP_MOD2N) ||         \
                                      ((type) == SEC_ENG_PKA_OP_LDIV2N) ||        \
                                      ((type) == SEC_ENG_PKA_OP_LMUL2N) ||        \
                                      ((type) == SEC_ENG_PKA_OP_LDIV) ||          \
                                      ((type) == SEC_ENG_PKA_OP_LSQR) ||          \
                                      ((type) == SEC_ENG_PKA_OP_LMUL) ||          \
                                      ((type) == SEC_ENG_PKA_OP_LSUB) ||          \
                                      ((type) == SEC_ENG_PKA_OP_LADD) ||          \
                                      ((type) == SEC_ENG_PKA_OP_LCMP) ||          \
                                      ((type) == SEC_ENG_PKA_OP_MDIV2) ||         \
                                      ((type) == SEC_ENG_PKA_OP_MINV) ||          \
                                      ((type) == SEC_ENG_PKA_OP_MEXP) ||          \
                                      ((type) == SEC_ENG_PKA_OP_MSQR) ||          \
                                      ((type) == SEC_ENG_PKA_OP_MMUL) ||          \
                                      ((type) == SEC_ENG_PKA_OP_MREM) ||          \
                                      ((type) == SEC_ENG_PKA_OP_MSUB) ||          \
                                      ((type) == SEC_ENG_PKA_OP_MADD) ||          \
                                      ((type) == SEC_ENG_PKA_OP_RESIZE) ||        \
                                      ((type) == SEC_ENG_PKA_OP_MOVDAT) ||        \
                                      ((type) == SEC_ENG_PKA_OP_NLIR) ||          \
                                      ((type) == SEC_ENG_PKA_OP_SLIR) ||          \
                                      ((type) == SEC_ENG_PKA_OP_CLIR) ||          \
                                      ((type) == SEC_ENG_PKA_OP_CFLIRI_BUFFER) || \
                                      ((type) == SEC_ENG_PKA_OP_CTLIRI_PLD) ||    \
                                      ((type) == SEC_ENG_PKA_OP_CFLIR_BUFFER) ||  \
                                      ((type) == SEC_ENG_PKA_OP_CTLIR_PLD))

/** @defgroup  SEC_ENG_INT_TYPE
 *  @{
 */
#define IS_SEC_ENG_INT_TYPE(type) (((type) == SEC_ENG_INT_TRNG) || \
                                   ((type) == SEC_ENG_INT_AES) ||  \
                                   ((type) == SEC_ENG_INT_SHA) ||  \
                                   ((type) == SEC_ENG_INT_PKA) ||  \
                                   ((type) == SEC_ENG_INT_CDET) || \
                                   ((type) == SEC_ENG_INT_GMAC) || \
                                   ((type) == SEC_ENG_INT_ALL))

/*@} end of group SEC_ENG_Public_Constants */

/** @defgroup  SEC_ENG_Public_Macros
 *  @{
 */
#define SEC_ENG_PKA_STATUS_LAST_OPC_OFFSET 24
#define SEC_ENG_PKA_STATUS_LAST_OPC_MASK   0x01000000

/*@} end of group SEC_ENG_Public_Macros */

/** @defgroup  SEC_ENG_Public_Functions
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
void SEC_GMAC_IRQHandler(void);
void SEC_CDET_IRQHandler(void);
void SEC_TRNG_IRQHandler(void);
void SEC_PKA_IRQHandler(void);
void SEC_AES_IRQHandler(void);
void SEC_SHA_IRQHandler(void);
#endif
void Sec_Eng_SHA256_Init(SEC_Eng_SHA256_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, SEC_ENG_SHA_Type shaType,
                         uint32_t shaTmpBuf[16], uint32_t padding[16]);
void Sec_Eng_SHA512_Init(SEC_Eng_SHA512_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, SEC_ENG_SHA_Type shaType,
                         uint64_t shaTmpBuf[16], uint64_t padding[16]);
void Sec_Eng_MD5_Init(SEC_Eng_MD5_Ctx *md5Ctx, SEC_ENG_SHA_ID_Type shaNo, SEC_ENG_SHA_Type shaType,
                      uint32_t md5TmpBuf[16], uint32_t padding[16]);
void Sec_Eng_SHA_Start(SEC_ENG_SHA_ID_Type shaNo);
BL_Err_Type Sec_Eng_SHA256_Update(SEC_Eng_SHA256_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, const uint8_t *input,
                                  uint32_t len);
BL_Err_Type Sec_Eng_SHA512_Update(SEC_Eng_SHA512_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, const uint8_t *input,
                                  uint64_t len);
BL_Err_Type Sec_Eng_MD5_Update(SEC_Eng_MD5_Ctx *md5Ctx, SEC_ENG_SHA_ID_Type shaNo, const uint8_t *input,
                               uint32_t len);
BL_Err_Type Sec_Eng_SHA256_Finish(SEC_Eng_SHA256_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, uint8_t *hash);
BL_Err_Type Sec_Eng_SHA512_Finish(SEC_Eng_SHA512_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, uint8_t *hash);
BL_Err_Type Sec_Eng_MD5_Finish(SEC_Eng_MD5_Ctx *md5Ctx, SEC_ENG_SHA_ID_Type shaNo, uint8_t *hash);
void Sec_Eng_SHA_Enable_Link(SEC_ENG_SHA_ID_Type shaNo);
void Sec_Eng_SHA_Disable_Link(SEC_ENG_SHA_ID_Type shaNo);
void Sec_Eng_SHA256_Link_Init(SEC_Eng_SHA256_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, uint32_t linkAddr,
                              uint32_t shaTmpBuf[16], uint32_t padding[16]);
void Sec_Eng_SHA512_Link_Init(SEC_Eng_SHA512_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo, uint32_t linkAddr,
                              uint64_t shaTmpBuf[16], uint64_t padding[16]);
void Sec_Eng_MD5_Link_Init(SEC_Eng_MD5_Link_Ctx *md5Ctx, SEC_ENG_SHA_ID_Type shaNo, uint32_t linkAddr,
                           uint32_t md5TmpBuf[16], uint32_t padding[16]);
void Sec_Eng_Set_MD5_Din(SEC_ENG_AES_ID_Type aesNo);
void Sec_Eng_Set_MD5_Din_Be(SEC_ENG_AES_ID_Type aesNo);
void Sec_Eng_Set_MD5_Dout(SEC_ENG_AES_ID_Type aesNo);
void Sec_Eng_Set_MD5_Dout_BE(SEC_ENG_AES_ID_Type aesNo);
BL_Err_Type Sec_Eng_SHA256_Link_Update(SEC_Eng_SHA256_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo,
                                       const uint8_t *input, uint32_t len);
BL_Err_Type Sec_Eng_SHA512_Link_Update(SEC_Eng_SHA512_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo,
                                       const uint8_t *input, uint64_t len);
BL_Err_Type Sec_Eng_MD5_Link_Update(SEC_Eng_MD5_Link_Ctx *md5Ctx, SEC_ENG_SHA_ID_Type shaNo,
                                    const uint8_t *input, uint32_t len);
BL_Err_Type Sec_Eng_SHA256_Link_Finish(SEC_Eng_SHA256_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo,
                                       uint8_t *hash);
BL_Err_Type Sec_Eng_SHA512_Link_Finish(SEC_Eng_SHA512_Link_Ctx *shaCtx, SEC_ENG_SHA_ID_Type shaNo,
                                       uint8_t *hash);
BL_Err_Type Sec_Eng_MD5_Link_Finish(SEC_Eng_MD5_Link_Ctx *md5Ctx, SEC_ENG_SHA_ID_Type shaNo,
                                    uint8_t *hash);
BL_Err_Type Sec_Eng_Group0_Request_SHA_Access(void);
BL_Err_Type Sec_Eng_Group0_Release_SHA_Access(void);
BL_Err_Type Sec_Eng_Group1_Request_SHA_Access(void);
BL_Err_Type Sec_Eng_Group1_Release_SHA_Access(void);
BL_Err_Type Sec_Eng_AES_Init(SEC_Eng_AES_Ctx *aesCtx, SEC_ENG_AES_ID_Type aesNo, SEC_ENG_AES_Type aesType,
                             SEC_ENG_AES_Key_Type keyType, SEC_ENG_AES_EnDec_Type enDecType);
void Sec_Eng_AES_Enable_LE(SEC_ENG_AES_ID_Type aesNo);
void Sec_Eng_AES_Enable_BE(SEC_ENG_AES_ID_Type aesNo);
void Sec_Eng_AES_Enable_Link(SEC_ENG_AES_ID_Type aesNo);
void Sec_Eng_AES_Disable_Link(SEC_ENG_AES_ID_Type aesNo);
BL_Err_Type Sec_Eng_CRC16_Link_Work(SEC_ENG_SHA_ID_Type shaNo, uint32_t linkAddr, const uint8_t *in, uint32_t len,
                                    uint8_t *out);
BL_Err_Type Sec_Eng_CRC32_Link_Work(SEC_ENG_SHA_ID_Type shaNo, uint32_t linkAddr, const uint8_t *in, uint32_t len,
                                    uint8_t *out);
BL_Err_Type Sec_Eng_AES_Link_Work(SEC_ENG_AES_ID_Type aesNo, uint32_t linkAddr, const uint8_t *in, uint32_t len,
                                  uint8_t *out);
void Sec_Eng_AES_Set_Hw_Key_Src(SEC_ENG_AES_ID_Type aesNo, uint8_t src);
void Sec_Eng_AES_Set_Key_IV(SEC_ENG_AES_ID_Type aesNo, SEC_ENG_AES_Key_Src_Type keySrc, const uint8_t *key,
                            const uint8_t *iv);
void Sec_Eng_AES_Set_Key_IV_BE(SEC_ENG_AES_ID_Type aesNo, SEC_ENG_AES_Key_Src_Type keySrc, const uint8_t *key,
                               const uint8_t *iv);
void Sec_Eng_AES_Set_Counter_Byte(SEC_ENG_AES_ID_Type aesNo, SEC_ENG_AES_Counter_Type counterType);
BL_Err_Type Sec_Eng_AES_Crypt(SEC_Eng_AES_Ctx *aesCtx, SEC_ENG_AES_ID_Type aesNo, const uint8_t *in, uint32_t len,
                              uint8_t *out);
BL_Err_Type Sec_Eng_AES_Finish(SEC_ENG_AES_ID_Type aesNo);
BL_Err_Type Sec_Eng_Group0_Request_AES_Access(void);
BL_Err_Type Sec_Eng_Group0_Release_AES_Access(void);
BL_Err_Type Sec_Eng_Group1_Request_AES_Access(void);
BL_Err_Type Sec_Eng_Group1_Release_AES_Access(void);
BL_Err_Type Sec_Eng_Trng_Enable(void);
void Sec_Eng_Trng_Int_Enable(void);
void Sec_Eng_Trng_Int_Disable(void);
BL_Err_Type Sec_Eng_Trng_Read(uint8_t data[32]);
BL_Err_Type Sec_Eng_Trng_Get_Random(uint8_t *data, uint32_t len);
void Sec_Eng_Trng_Int_Read_Trigger(void);
void Sec_Eng_Trng_Int_Read(uint8_t data[32]);
void Sec_Eng_Trng_Disable(void);
BL_Err_Type Sec_Eng_Group0_Request_Trng_Access(void);
BL_Err_Type Sec_Eng_Group0_Release_Trng_Access(void);
BL_Err_Type Sec_Eng_Group1_Request_Trng_Access(void);
BL_Err_Type Sec_Eng_Group1_Release_Trng_Access(void);
void Sec_Eng_PKA_Reset(void);
void Sec_Eng_PKA_BigEndian_Enable(void);
void Sec_Eng_PKA_LittleEndian_Enable(void);
void Sec_Eng_PKA_GetStatus(SEC_Eng_PKA_Status_Type *status);
void Sec_Eng_PKA_Write_Data(SEC_ENG_PKA_REG_SIZE_Type regType, uint8_t regIndex, const uint32_t *data, uint16_t size,
                            uint8_t lastOp);
void Sec_Eng_PKA_Read_Data(SEC_ENG_PKA_REG_SIZE_Type regType, uint8_t regIdx, uint32_t *result, uint8_t retSize);
void Sec_Eng_PKA_CREG(SEC_ENG_PKA_REG_SIZE_Type dRegType, uint8_t dRegIdx, uint8_t size, uint8_t lastOp);
void Sec_Eng_PKA_Write_Immediate(SEC_ENG_PKA_REG_SIZE_Type regType, uint8_t regIndex, uint32_t data, uint8_t lastOp);
void Sec_Eng_PKA_NREG(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_Move_Data(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_RESIZE(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_MADD(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s1RegType,
                      uint8_t s1RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_MSUB(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s1RegType,
                      uint8_t s1RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_MREM(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s2RegType,
                      uint8_t s2RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_MMUL(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s1RegType,
                      uint8_t s1RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_MSQR(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s2RegType,
                      uint8_t s2RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_MEXP(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s1RegType,
                      uint8_t s1RegIdx, uint8_t s2RegType, uint8_t s2RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_MINV(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s2RegType,
                      uint8_t s2RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_MINV(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s2RegType,
                      uint8_t s2RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_LCMP(uint8_t *cout, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t s1RegType, uint8_t s1RegIdx);
void Sec_Eng_PKA_LADD(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s1RegType,
                      uint8_t s1RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_LSUB(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s1RegType,
                      uint8_t s1RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_LMUL(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s1RegType,
                      uint8_t s1RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_LSQR(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_LDIV(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                      uint8_t s2RegType,
                      uint8_t s2RegIdx, uint8_t lastOp);
void Sec_Eng_PKA_LMUL2N(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                        uint16_t bit_shift,
                        uint8_t lastOp);
void Sec_Eng_PKA_LDIV2N(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                        uint16_t bit_shift,
                        uint8_t lastOp);
void Sec_Eng_PKA_LMOD2N(uint8_t dRegType, uint8_t dRegIdx, uint8_t s0RegType, uint8_t s0RegIdx,
                        uint16_t bit_shift,
                        uint8_t lastOp);
void Sec_Eng_PKA_GF2Mont(uint8_t dRegType, uint8_t dRegIdx, uint8_t sRegType, uint8_t sRegIdx, uint32_t size,
                         uint8_t tRegType, uint8_t tRegIdx, uint8_t pRegType, uint8_t pRegIdx);
void Sec_Eng_PKA_Mont2GF(uint8_t dRegType, uint8_t dRegIdx, uint8_t aRegType, uint8_t aRegIdx, uint8_t invrRegType,
                         uint8_t invrRegIdx,
                         uint8_t tRegType, uint8_t tRegIdx, uint8_t pRegType, uint8_t pRegIdx);
BL_Err_Type Sec_Eng_Group0_Request_PKA_Access(void);
BL_Err_Type Sec_Eng_Group0_Release_PKA_Access(void);
BL_Err_Type Sec_Eng_Group1_Request_PKA_Access(void);
BL_Err_Type Sec_Eng_Group1_Release_PKA_Access(void);
void Sec_Eng_GMAC_Enable_LE(void);
void Sec_Eng_GMAC_Enable_BE(void);
void Sec_Eng_GMAC_Enable_Link(void);
void Sec_Eng_GMAC_Disable_Link(void);
BL_Err_Type Sec_Eng_GMAC_Link_Work(uint32_t linkAddr, const uint8_t *in, uint32_t len, uint8_t *out);
BL_Err_Type Sec_Eng_Group0_Request_GMAC_Access(void);
BL_Err_Type Sec_Eng_Group0_Release_GMAC_Access(void);
BL_Err_Type Sec_Eng_Group1_Request_GMAC_Access(void);
BL_Err_Type Sec_Eng_Group1_Release_GMAC_Access(void);
void SEC_Eng_IntMask(SEC_ENG_INT_Type intType, BL_Mask_Type intMask);
void SEC_Eng_ClrIntStatus(SEC_ENG_INT_Type intType);
void SEC_Eng_Int_Callback_Install(SEC_ENG_INT_Type intType, intCallback_Type *cbFun);
BL_Sts_Type SEC_Eng_GetIntStatus(SEC_ENG_INT_Type intType);
/*----------*/
void SEC_Eng_Turn_On_Sec_Ring(void);
void SEC_Eng_Turn_Off_Sec_Ring(void);
void Sec_Eng_PKA_Clear_Int(void);
void Sec_Eng_PKA_Read_Block(uint32_t *dest, const uint32_t *src, uint32_t len);
void Sec_Eng_PKA_Read_Block(uint32_t *dest, const uint32_t *src, uint32_t len);
void Sec_Eng_PKA_Write_Block(uint32_t *dest, const uint32_t *src, uint32_t len);
void Sec_Eng_PKA_Write_Block(uint32_t *dest, const uint32_t *src, uint32_t len);
/*----------*/;

/*@} end of group SEC_ENG_Public_Functions */

/*@} end of group SEC_ENG */

/*@} end of group BL808_Peripheral_Driver */

#endif /* __BL808_SEC_ENG_H__ */
